; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_4 ?v4)
               (pred_2 ?v4)
               (pred_5)
               (pred_1 ?v4)
               (pred_3 ?v4 ?v3))

  (:action op_4
    :parameters (?v1)
    :precondition (and (pred_4 ?v1) (pred_2 ?v1) (pred_5))
    :effect (and (pred_1 ?v1) (not (pred_4 ?v1)) (not (pred_2 ?v1)) 
                 (not (pred_5))))

  (:action op_3
    :parameters  (?v1)
    :precondition (pred_1 ?v1)
    :effect (and (pred_4 ?v1) (pred_5) (pred_2 ?v1) 
                 (not (pred_1 ?v1))))

  (:action op_1
    :parameters  (?v1 ?v2)
    :precondition (and (pred_4 ?v2) (pred_1 ?v1))
    :effect (and (pred_5) (pred_4 ?v1) (pred_3 ?v1 ?v2)
                 (not (pred_4 ?v2)) (not (pred_1 ?v1))))

  (:action op_2
    :parameters  (?v1 ?v2)
    :precondition (and (pred_3 ?v1 ?v2) (pred_4 ?v1) (pred_5))
    :effect (and (pred_1 ?v1) (pred_4 ?v2)
                 (not (pred_3 ?v1 ?v2)) (not (pred_4 ?v1)) (not (pred_5)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_05 obj_03 obj_01 obj_04 obj_02 obj_06 )
(:init
(pred_5)
(pred_2 obj_05)
(pred_2 obj_03)
(pred_3 obj_01 obj_03)
(pred_3 obj_04 obj_06)
(pred_3 obj_02 obj_04)
(pred_3 obj_06 obj_01)
(pred_4 obj_05)
(pred_4 obj_02)
)
(:goal
(and
(pred_3 obj_05 obj_03)
(pred_3 obj_03 obj_02)
(pred_3 obj_01 obj_04)
(pred_2 obj_04)
(pred_2 obj_02)
(pred_3 obj_06 obj_01))
)

(:constraints
  (sometime-before (pred_3 obj_03 obj_02) (pred_3 obj_05 obj_03))
)
)

; plan
1. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02 obj_04) (pred_4 obj_02) (pred_5)
   added: (pred_1 obj_02) (pred_4 obj_04)
   goals met: 1 of 6
2. (op_3 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_4 obj_02) (pred_5) (pred_2 obj_02)
   goals met: 2 of 6
3. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04 obj_06) (pred_4 obj_04) (pred_5)
   added: (pred_1 obj_04) (pred_4 obj_06)
   goals met: 2 of 6
4. (op_3 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_4 obj_04) (pred_5) (pred_2 obj_04)
   goals met: 3 of 6
5. (op_2 obj_06 obj_01)
   deleted: (pred_3 obj_06 obj_01) (pred_4 obj_06) (pred_5)
   added: (pred_1 obj_06) (pred_4 obj_01)
   goals met: 2 of 6
6. (op_3 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_4 obj_06) (pred_5) (pred_2 obj_06)
   goals met: 2 of 6
7. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_01 obj_03) (pred_4 obj_01) (pred_5)
   added: (pred_1 obj_01) (pred_4 obj_03)
   goals met: 2 of 6
8. (op_3 obj_01)
   deleted: (pred_1 obj_01)
   added: (pred_4 obj_01) (pred_5) (pred_2 obj_01)
   goals met: 2 of 6
9. (op_4 obj_06)
   deleted: (pred_4 obj_06) (pred_2 obj_06) (pred_5)
   added: (pred_1 obj_06)
   goals met: 2 of 6
10. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_01) (pred_1 obj_06)
   added: (pred_5) (pred_4 obj_06) (pred_3 obj_06 obj_01)
   goals met: 3 of 6
11. (op_4 obj_05)
   deleted: (pred_4 obj_05) (pred_2 obj_05) (pred_5)
   added: (pred_1 obj_05)
   goals met: 3 of 6
12. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_03) (pred_1 obj_05)
   added: (pred_5) (pred_4 obj_05) (pred_3 obj_05 obj_03)
   goals met: 4 of 6
13. (op_4 obj_04)
   deleted: (pred_4 obj_04) (pred_2 obj_04) (pred_5)
   added: (pred_1 obj_04)
   goals met: 3 of 6
14. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_06) (pred_1 obj_04)
   added: (pred_5) (pred_4 obj_04) (pred_3 obj_04 obj_06)
   goals met: 3 of 6
15. (op_2 obj_05 obj_03)
   deleted: (pred_3 obj_05 obj_03) (pred_4 obj_05) (pred_5)
   added: (pred_1 obj_05) (pred_4 obj_03)
   goals met: 2 of 6
16. (op_1 obj_05 obj_04)
   deleted: (pred_4 obj_04) (pred_1 obj_05)
   added: (pred_5) (pred_4 obj_05) (pred_3 obj_05 obj_04)
   goals met: 2 of 6
17. (op_4 obj_03)
   deleted: (pred_4 obj_03) (pred_2 obj_03) (pred_5)
   added: (pred_1 obj_03)
   goals met: 2 of 6
18. (op_1 obj_03 obj_02)
   deleted: (pred_4 obj_02) (pred_1 obj_03)
   added: (pred_5) (pred_4 obj_03) (pred_3 obj_03 obj_02)
   goals met: 3 of 6
19. (op_2 obj_05 obj_04)
   deleted: (pred_3 obj_05 obj_04) (pred_4 obj_05) (pred_5)
   added: (pred_1 obj_05) (pred_4 obj_04)
   goals met: 3 of 6
20. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_03) (pred_1 obj_05)
   added: (pred_5) (pred_4 obj_05) (pred_3 obj_05 obj_03)
   goals met: 4 of 6
21. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04 obj_06) (pred_4 obj_04) (pred_5)
   added: (pred_1 obj_04) (pred_4 obj_06)
   goals met: 4 of 6
22. (op_3 obj_04)
   deleted: (pred_1 obj_04)
   added: (pred_4 obj_04) (pred_5) (pred_2 obj_04)
   goals met: 5 of 6
23. (op_2 obj_06 obj_01)
   deleted: (pred_3 obj_06 obj_01) (pred_4 obj_06) (pred_5)
   added: (pred_1 obj_06) (pred_4 obj_01)
   goals met: 4 of 6
24. (op_3 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_4 obj_06) (pred_5) (pred_2 obj_06)
   goals met: 4 of 6
25. (op_4 obj_01)
   deleted: (pred_4 obj_01) (pred_2 obj_01) (pred_5)
   added: (pred_1 obj_01)
   goals met: 4 of 6
26. (op_1 obj_01 obj_04)
   deleted: (pred_4 obj_04) (pred_1 obj_01)
   added: (pred_5) (pred_4 obj_01) (pred_3 obj_01 obj_04)
   goals met: 5 of 6
27. (op_4 obj_06)
   deleted: (pred_4 obj_06) (pred_2 obj_06) (pred_5)
   added: (pred_1 obj_06)
   goals met: 5 of 6
28. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_01) (pred_1 obj_06)
   added: (pred_5) (pred_4 obj_06) (pred_3 obj_06 obj_01)
   goals met: 6 of 6
